app/Controllers/Ajax.php

SELECT *
FROM `trendharga`
ORDER BY `trendharga_id` DESC
 LIMIT 1
---
    function getHarga()
    {
        $latest = $this->request->getGet('latest');
        $model = new TrendhargaModel();
        $model->orderBy('trendharga_id', 'desc');
        $harga = $model->first();